import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-curriculum',
  templateUrl: './curriculum.component.html',
  styleUrls: ['./curriculum.component.css']
})
export class CurriculumComponent implements OnInit {

  taragatis: any;
  currentCount: number;
  
  constructor() { 
    this.currentCount = 0,
    this.taragatis =[
              {
                  name: 'శేషాద్రి',
                  pathyaamsams: ['చిన్న చిన్న తెలుగు పదాలతో పిల్లలను పూర్తిగా తెలుగులో వాక్యాలు మాట్లాడే విధంగా ఉత్సాహపరచడం',
                  'పిల్లలకు అర్థమయ్యేలా ప్రశ్నలడిగి పూర్తివాక్యముగా సమాధానము చెప్పమని అడగడం.',
                  'పిల్లలతో, పిల్లలని తెలుగులో మాట్లాడమని, ప్రశ్నలడగమని, సమాధానాలు చెప్పమని సంభాషణ చేయించడం.',
                  'అచ్చులు - అక్షరాలని దిద్దించడం.',
                  'చిన్న చిన్న పద్యాలు, పాటలు, కథలు నేర్పించడం.',
                  'సాంస్కృతిక కార్యక్రముములో చిన్న ప్రదర్శన చేయడం.'],
                  lakshyams: ['అచ్చులు - వ్రాయడం, చదవడం, గుర్తు పట్టడం.',
                  'వారముల పేర్లు నేర్చుకోవడం.',
                  'పండ్లు పేర్లు చెప్పడం.',
                  '1 నుండి 20 వరకు అంకెలు లెక్కించడం',
                  'పద్యాలు, పాటలు అప్పచెప్పడం.']
              },          
              {
                name: 'గరుడాద్రి',
                pathyaamsams: ['హల్లులు - అక్షరాలని దిద్దించడం.',
                'గుణింతాలు లేని రెండు, మూడు అక్షరముల పదాలను వ్రాయడం, చదవడం.',
                'పిల్లలచేత చిన్నచిన్న కథలను చెప్పించడము',
                'చిన్న చిన్న పద్యాలు, పాటలు, కథలు నేర్పించడం.',
                'సాంస్కృతిక కార్యక్రముములో చిన్న ప్రదర్శన చేయడం.'],
                lakshyams: ['హల్లులు - వ్రాయడం, చదవడం, గుర్తు పట్టడం.',
                'అవయముల పేర్లు నేర్చుకోవడం.',
                'అవయములతో, చేసే క్రియలను చెప్పడం. (ఉదాహరణం: కళ్ళతో చూస్తాము)',
                '1 నుండి 100 వరకు అంకెలులెక్కించడం',
                'పద్యాలు, పాటలు అప్పచెప్పడం.']
              },          
              {
                name: 'వృషభాద్రి',
                pathyaamsams: ['గుణింతాలు, ఒత్తులు - అక్షరాలని దిద్దించడం',
                'చిన్న చిన్న పద్యాలు, పాటలు, కథలు నేర్పించడం.',
                'సాంస్కృతిక కార్యక్రముములో చిన్న ప్రదర్శన చేయడం.'],
                lakshyams: ['గుణింతాలు, ఒత్తులు - వ్రాయడం, చదవడం, గుర్తు పట్టడం.',
                        'పద్యాలు, పాటలు అప్పచెప్పడం.']
              },          
              {
                name: 'వృషాద్రి',
                pathyaamsams: ['పద్యములు, పాఠములు, కథలు పిల్లతో చదివించడం.',
                'కష్ఠమైన పదములను, వాక్యములను వ్రాయించడం.',
                'వ్యాకరణము: భాషాభాగములు, లింగములు, వచనములు, విభక్తులు.',
                'సాంస్కృతిక కార్యక్రముములో చిన్న ప్రదర్శన చేయడం.'],
                lakshyams: ['తప్పులు లేకుండా తెలుగు వాక్యములను వ్రాయడం.',
                        'పద్యాలు, పాటలు అప్పచెప్పడం.']
              },          
              {
                name: 'అంజనాద్రి',
                pathyaamsams: ['వివరించి సమధానములు వ్రాయడం.',
                'సరళ వ్యాసములు, లేఖలు వ్రాయడము.',
                'చందమామ వంటి పిల్లల పుస్తకములను చదివి వ్యాఖ్యలు చెయ్యడము.',
                'వ్యాకరణము: సంధులు, సమాసములు',
                'సాంస్కృతిక కార్యక్రముములో చిన్న ప్రదర్శన చేయడం.'],
                lakshyams: ['అనర్గళంగా తెలుగులో మాట్లాడటము.',
                'పద్యములు, కథలు చెప్పటము',
                'ఏదయినా విషయముపై ప్రసంగం చేయడము',
                  ]
              },          
              {
                name: 'నారాయణాద్రి',
                pathyaamsams: ['వ్యాసములు సంగ్రహముగా వ్రాయడము..',
                'అంతర్జాలములో తెలుగు సాహిత్యమును చదివి అర్థము చేసుకోవడము.',
                'పద్యములకు ప్రతిపదార్థము, భావములు వ్రాయడము.',
                'వ్యాకరణము: అలంకారములు, చందస్సు.',
                'సాంస్కృతిక కార్యక్రముములో చిన్న ప్రదర్శన చేయడం.'],
                lakshyams: ['తెలుగులో చర్చలు, వాదోపవాదాలు చెయ్యడము.',
                        'ఆత్మవిశ్వాసముతో సభాముఖముగా మాట్లాడటము.']
              },          
              {
                name: 'వెంకటాద్రి',
                pathyaamsams: ['ఇతరభాషా వ్యాసములను తెలుగులోనికి అనువాదము చెయ్యడము.',
                'తెలుగులో కవితలు, పాటలు, పద్యాలు స్వంతముగా వ్రాయడము.',
                'సాంస్కృతిక కార్యక్రముములో చిన్న ప్రదర్శన చేయడం.'],
                lakshyams: ['తెలుగులో చర్చలు, వాదోపవాదాలు చెయ్యడము.',
                'ఆత్మవిశ్వాసముతో సభాముఖముగా మాట్లాడటము.',
                'కార్యక్రమములు నిర్వహించడము']
              }
    ]
  }
  
  incrementCounter(i: number) {
    this.currentCount = i;
  }

  ngOnInit(): void {
  }

}

